---
kind: property
id: P:Autodesk.Revit.DB.Form.HasOpenGeometry
zh: 对话框、窗口、窗体
source: html/08f123dc-a066-1635-cd12-41f060a6f0c5.htm
---
# Autodesk.Revit.DB.Form.HasOpenGeometry Property

**中文**: 对话框、窗口、窗体

Tell if the form has an open geometry.

## Syntax (C#)
```csharp
public bool HasOpenGeometry { get; }
```